In [83]:
import numpy as np
import pandas as pd

#Series的實體
#Series有方法和屬性
obj = pd.Series([4.5, 7.2, -5.3, 3.6],index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [84]:
obj.shape

(4,)

In [85]:
obj[0]

4.5

In [86]:
obj.dtype

dtype('float64')

In [87]:
#排序
obj.reindex(index=['a', 'b', 'c', 'd'])

a   -5.3
b    7.2
c    3.6
d    4.5
dtype: float64

In [88]:
#刪除
obj1 = obj.reindex(index=['a', 'b'])
obj1

a   -5.3
b    7.2
dtype: float64

In [89]:
#新增
obj.reindex(['a','b','c','e'])

a   -5.3
b    7.2
c    3.6
e    NaN
dtype: float64

In [90]:
#DataFrame實體方法reindex()
frame = pd.DataFrame(np.arange(9).reshape((3,3)),
             index=['a', 'c', 'd'],
            columns=['台北', '台中', '高雄'])
frame

   台北  台中  高雄
a   0   1   2
c   3   4   5
d   6   7   8

In [91]:
frame.shape

(3, 3)

In [92]:
frame.dtypes

台北    int64
台中    int64
高雄    int64
dtype: object

In [93]:
frame.values

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [94]:
frame1 = frame.reindex(index=['a', 'c'])
frame

   台北  台中  高雄
a   0   1   2
c   3   4   5
d   6   7   8

In [95]:
frame1

   台北  台中  高雄
a   0   1   2
c   3   4   5

In [96]:
frame.reindex(index=['a','c'],columns=['台北', '台中'])

   台北  台中
a   0   1
c   3   4

In [97]:
#Series實體方法drop()
obj = pd.Series(np.arange(5.),index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [98]:
obj.drop('c')

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [99]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [100]:
#DataFrame實體方法drop()
data = pd.DataFrame(np.arange(16).reshape(4,4),
                   index=['台北','台中', '台南', '高雄'],
                   columns=['one', 'two', 'three', 'four'])
data

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

In [101]:
#預設drop是移除列
dropedData = data.drop(['台北', '台中'])
dropedData

    one  two  three  four
台南    8    9     10    11
高雄   12   13     14    15

In [102]:
data.drop('two', axis=1)

    one  three  four
台北    0      2     3
台中    4      6     7
台南    8     10    11
高雄   12     14    15

In [103]:
#索引、選取、過濾
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [104]:
obj[0]

0.0

In [105]:
obj['a']

0.0

In [106]:
obj[0:2]

a    0.0
b    1.0
dtype: float64

In [107]:
obj[1:3]

b    1.0
c    2.0
dtype: float64

In [108]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [109]:
obj['a':'c']

a    0.0
b    1.0
c    2.0
dtype: float64

In [110]:
obj[['a', 'c', 'd']]

a    0.0
c    2.0
d    3.0
dtype: float64

In [111]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [112]:
obj < 2

a     True
b     True
c    False
d    False
dtype: bool

In [113]:
#過濾
obj[obj<1]

a    0.0
dtype: float64

In [114]:
#DataFrame[欄的名稱]
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                   index=['台北','台中','台南', '高雄'],
                   columns=['one', 'two', 'three', 'four'])
data

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

In [115]:
data[['one', 'two']]

    one  two
台北    0    1
台中    4    5
台南    8    9
高雄   12   13

In [116]:
data[['one']]

    one
台北    0
台中    4
台南    8
高雄   12

In [117]:
data['one']

台北     0
台中     4
台南     8
高雄    12
Name: one, dtype: int64

In [118]:
#如果不能用整數索引,只能使用整數的slice,取出的是列(一橫欄)
data

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

In [119]:
data[:2]

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7

In [120]:
#loc[列,欄],iloc[列,欄]
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                   index=['台北','台中','台南', '高雄'],
                   columns=['one', 'two', 'three', 'four'])
data

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

In [121]:
data.loc['台北',['one', 'three']]

one      0
three    2
Name: 台北, dtype: int64

In [122]:
data.loc[['台北','高雄'],['one', 'three']]

    one  three
台北    0      2
高雄   12     14

In [124]:
data.loc[['台北'],['one','three']]

    one  three
台北    0      2

In [ ]:
data

In [ ]:
data.iloc[[0,1],[2,3]]

In [ ]:
data.iloc[:,:2]

In [ ]:
data.iloc[:,[0,2]]